#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/amevans/tf-prod/runs/run-nQRfepm7zB3ddAqt

Waiting for the plan to start...

Terraform v1.1.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.storybook_s3_bucket.aws_s3_bucket_policy.default: Refreshing state... [id=amevans.aws.main-public-production]
module.storybook_s3_bucket.aws_s3_bucket_public_access_block.default: Refreshing state... [id=amevans.aws.main-public-production]
module.storybook_s3_bucket.aws_s3_bucket.default: Refreshing state... [id=amevans.aws.main-public-production]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.storybook_s3_bucket.aws_s3_bucket.default has changed
  ~ resource "aws_s3_bucket" "default" {
        id                          = "amevans.aws.main-public-production"
      + tags                        = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.storybook_s3_bucket.aws_s3_bucket_policy.default has changed
  ~ resource "aws_s3_bucket_policy" "default" {
        id     = "amevans.aws.main-public-production"
      ~ policy = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = "s3:GetObject"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "*"
                        }
                        Resource  = "arn:aws:s3:::amevans.aws.main-public-production/*"
                        Sid       = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
        # (1 unchanged attribute hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_instance.web will be created
  + resource "aws_instance" "web" {
      + ami                          = "ami-000722651477bd39b"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t2.micro"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tenancy                      = (known after apply)
      + user_data                    = "d36263b945850b1251dc22e4ed5c62aeb9e9e0f0"
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_security_group.web-sg will be created
  + resource "aws_security_group" "web-sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # random_pet.sg will be created
  + resource "random_pet" "sg" {
      + id        = (known after apply)
      + length    = 2
      + separator = "-"
    }

  # module.storybook_s3_bucket.aws_s3_bucket.default will be destroyed
  # (because aws_s3_bucket.default is not in configuration)
  - resource "aws_s3_bucket" "default" {
      - acl                         = "private" -> null
      - arn                         = "arn:aws:s3:::amevans.aws.main-public-production" -> null
      - bucket                      = "amevans.aws.main-public-production" -> null
      - bucket_domain_name          = "amevans.aws.main-public-production.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "amevans.aws.main-public-production.s3.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null
      - id                          = "amevans.aws.main-public-production" -> null
      - region                      = "us-east-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.storybook_s3_bucket.aws_s3_bucket_policy.default will be destroyed
  # (because aws_s3_bucket_policy.default is not in configuration)
  - resource "aws_s3_bucket_policy" "default" {
      - bucket = "amevans.aws.main-public-production" -> null
      - id     = "amevans.aws.main-public-production" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:s3:::amevans.aws.main-public-production/*"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
    }

  # module.storybook_s3_bucket.aws_s3_bucket_public_access_block.default will be destroyed
  # (because aws_s3_bucket_public_access_block.default is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "default" {
      - block_public_acls       = true -> null
      - block_public_policy     = false -> null
      - bucket                  = "amevans.aws.main-public-production" -> null
      - id                      = "amevans.aws.main-public-production" -> null
      - ignore_public_acls      = false -> null
      - restrict_public_buckets = false -> null
    }

Plan: 3 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  + web-address = (known after apply)

```

</details>

*Pusher: @amevans-aws, Action: `pull_request`*